In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
my_ser = Series([1,2,3,4], index = ['A','B','C','D'])

In [3]:
my_ser

A    1
B    2
C    3
D    4
dtype: int64

In [4]:
my_ser.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [5]:
my_ser.values

array([1, 2, 3, 4])

In [6]:
my_ser[2]

3

In [7]:
my_index = my_ser.index

In [8]:
my_index[0]

'A'

In [9]:
my_index[0] = 'AA'

TypeError: Index does not support mutable operations

In [10]:
# we cannot change the index by the above reassignment

In [11]:
from numpy.random import randn

In [12]:
# reindexing method

In [13]:
ser1 = Series([1,2,3,4], index = ['A', 'B', 'C', 'D'])

ser1

A    1
B    2
C    3
D    4
dtype: int64

In [14]:
ser2 = ser1.reindex(['A', 'B', 'C', 'D', 'E', 'F'])

In [15]:
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [16]:
ser2.reindex(['A','B','C','D','E','F','G'], fill_value = 0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [17]:
ser3 = Series(['USA', 'Mexico', 'Canada'], index = [0,5,10])

In [18]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [19]:
ranger = range(15)

In [21]:
list(ranger)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

ser3.reindex(ranger, method = 'ffill')

In [22]:
ser3.reindex(ranger, method = 'ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [23]:
dframe = DataFrame(randn(25).reshape((5,5)), 
                   index = ['A', 'B', 'D', 'E', 'F'], 
                   columns = ['col1','col2', 'col3','col4', 'col5'])

In [24]:
dframe

       col1      col2      col3      col4      col5
A  0.018328  0.845462  0.209476  0.665758  0.763092
B  1.135909  1.292328  0.591896  2.626248 -0.698848
D -1.464938 -2.227210 -0.299711  1.069909  0.177047
E  0.871640 -0.214149  0.641559  0.668939  0.778083
F  0.309587 -0.046988 -0.039533  1.665127 -1.596336

In [25]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

In [26]:
dframe2

       col1      col2      col3      col4      col5
A  0.018328  0.845462  0.209476  0.665758  0.763092
B  1.135909  1.292328  0.591896  2.626248 -0.698848
C       NaN       NaN       NaN       NaN       NaN
D -1.464938 -2.227210 -0.299711  1.069909  0.177047
E  0.871640 -0.214149  0.641559  0.668939  0.778083
F  0.309587 -0.046988 -0.039533  1.665127 -1.596336

In [27]:
new_columns = ['col1', 'col2', 'col3', 'col4', 'col5', 'col6']

In [28]:
dframe2.reindex(columns = new_columns)

       col1      col2      col3      col4      col5  col6
A  0.018328  0.845462  0.209476  0.665758  0.763092   NaN
B  1.135909  1.292328  0.591896  2.626248 -0.698848   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.464938 -2.227210 -0.299711  1.069909  0.177047   NaN
E  0.871640 -0.214149  0.641559  0.668939  0.778083   NaN
F  0.309587 -0.046988 -0.039533  1.665127 -1.596336   NaN

In [38]:
dframe
dframe.loc[['A','B','C','D','E','F'], new_columns]

KeyError: "Passing list-likes to .loc or [] with any missing labels is no longer supported. The following labels were missing: Index(['C'], dtype='object'). See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike"

In [34]:
dframe2.loc['A']

col1    0.018328
col2    0.845462
col3    0.209476
col4    0.665758
col5    0.763092
Name: A, dtype: float64

In [36]:
dframe2.loc[['A','B']]

       col1      col2      col3      col4      col5
A  0.018328  0.845462  0.209476  0.665758  0.763092
B  1.135909  1.292328  0.591896  2.626248 -0.698848

In [39]:
dframe2.loc['A','col1']

0.01832813698315906

In [42]:
dframe2.iloc[1] = {'col1' : 0, 'col2' : 0}

In [44]:
dframe2

       col1      col2      col3      col4      col5
A  0.018328  0.845462  0.209476  0.665758  0.763092
B  0.000000  0.000000       NaN       NaN       NaN
C       NaN       NaN       NaN       NaN       NaN
D -1.464938 -2.227210 -0.299711  1.069909  0.177047
E  0.871640 -0.214149  0.641559  0.668939  0.778083
F  0.309587 -0.046988 -0.039533  1.665127 -1.596336

In [47]:
dframe2['col1'].loc[lambda s: s > 0]

A    0.018328
E    0.871640
F    0.309587
Name: col1, dtype: float64

In [48]:
#https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike%22

In [49]:
ser1 = Series(np.arange(3), index = ['a','b','c'])

In [50]:
ser1

a    0
b    1
c    2
dtype: int64

In [52]:
ser1.drop('b')

a    0
c    2
dtype: int64

In [53]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)), index = ['SF', 'LA', 'NY'], columns = ['pop', 'size', 'year'])

In [54]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [55]:
dframe1.drop('SF')

    pop  size  year
LA    3     4     5
NY    6     7     8

In [59]:
dframe1.drop('pop', axis = 1)

    size  year
SF     1     2
LA     4     5
NY     7     8

In [60]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [62]:
ser1 = Series(np.arange(3), index = ['A', 'B', 'C'])

In [63]:
ser1

A    0
B    1
C    2
dtype: int64

In [64]:
ser1 = ser1*2

In [65]:
ser1

A    0
B    2
C    4
dtype: int64

In [66]:
ser1['A']

0

In [68]:
ser1[1]

2

In [69]:
ser1[['A','B']]

A    0
B    2
dtype: int64

In [70]:
ser1[ser1>3]

C    4
dtype: int64

In [71]:
ser1[ser1>3] =10

In [72]:
ser1

A     0
B     2
C    10
dtype: int64

In [73]:
dframe = DataFrame(np.arange(25).reshape(5,5),
                   index = ['NYC', 'LA', 'SF', 'DC', 'Chi'],
                  columns = ['A', 'B', 'C', 'D', 'E'])

In [74]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [75]:
dframe[['B', 'E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [78]:
dframe[dframe['C'] > 8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [79]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [80]:
dframe > 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [81]:
dframe['A']

NYC     0
LA      5
SF     10
DC     15
Chi    20
Name: A, dtype: int64

In [82]:
dframe.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [83]:
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [84]:
ser1 = Series([0,1,2], index = ['A', 'B', 'C'])

In [85]:
ser1

A    0
B    1
C    2
dtype: int64

In [86]:
ser2 = Series([3,4,5,6], index = ['A','B', 'C', 'D'])

In [87]:
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [90]:
ser1 + ser2
list('AB')
list("ABCFD")

['A', 'B', 'C', 'F', 'D']

In [104]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)), columns = list('AB'), 
                   index = ['NYC', 'LA'])

In [93]:
dframe1

     A  B
NYC  0  1
LA   2  3

In [105]:
dframe2 = DataFrame(np.arange(9).reshape(3,3), 
                    columns = list('ADC'), 
                    index = ['NYC', 'SF', 'LA'])

In [101]:
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [102]:
dframe1+dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [103]:
dframe1.add(dframe2, fill_value = 0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [106]:
dframe1

     A  B
NYC  0  1
LA   2  3

In [107]:
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [108]:
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [109]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [110]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [111]:
ser3 = Series([0,1,2], index = ['A', 'B', 'C'])

In [112]:
ser3

A    0
B    1
C    2
dtype: int64

In [117]:
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [115]:
dframe2 -ser3

       A   B    C   D
NYC  0.0 NaN  0.0 NaN
SF   3.0 NaN  3.0 NaN
LA   6.0 NaN  6.0 NaN